Model Summary
----------

Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_8 (Conv2D)            (None, 256, 256, 64)      1664      
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 256, 256, 64)      102464    
_________________________________________________________________
max_pooling2d_5 (MaxPooling2 (None, 128, 128, 64)      0         
_________________________________________________________________
batch_normalization_5 (Batch (None, 128, 128, 64)      256       
_________________________________________________________________
conv2d_10 (Conv2D)           (None, 128, 128, 128)     73856     
_________________________________________________________________
conv2d_11 (Conv2D)           (None, 128, 128, 128)     147584    
_________________________________________________________________
max_pooling2d_6 (MaxPooling2 (None, 64, 64, 128)       0         
_________________________________________________________________
batch_normalization_6 (Batch (None, 64, 64, 128)       512       
_________________________________________________________________
conv2d_12 (Conv2D)           (None, 64, 64, 256)       295168    
_________________________________________________________________
conv2d_13 (Conv2D)           (None, 64, 64, 256)       590080    
_________________________________________________________________
max_pooling2d_7 (MaxPooling2 (None, 32, 32, 256)       0         
_________________________________________________________________
batch_normalization_7 (Batch (None, 32, 32, 256)       1024      
_________________________________________________________________
conv2d_14 (Conv2D)           (None, 32, 32, 512)       1180160   
_________________________________________________________________
conv2d_15 (Conv2D)           (None, 32, 32, 512)       2359808   
_________________________________________________________________
max_pooling2d_8 (MaxPooling2 (None, 16, 16, 512)       0         
_________________________________________________________________
batch_normalization_8 (Batch (None, 16, 16, 512)       2048      
_________________________________________________________________
max_pooling2d_9 (MaxPooling2 (None, 8, 8, 512)         0         
_________________________________________________________________
batch_normalization_9 (Batch (None, 8, 8, 512)         2048      
_________________________________________________________________
global_average_pooling2d_1 ( (None, 512)               0         
_________________________________________________________________
dense_3 (Dense)              (None, 2048)              1050624   
_________________________________________________________________
dropout_2 (Dropout)          (None, 2048)              0         
_________________________________________________________________
dense_4 (Dense)              (None, 1024)              2098176   
_________________________________________________________________
dropout_3 (Dropout)          (None, 1024)              0         
_________________________________________________________________
dense_5 (Dense)              (None, 3)                 3075      
=================================================================
Total params: 7,908,547
Trainable params: 7,905,603
Non-trainable params: 2,944
_________________________________________________________________

Train Metrics
------------

Classification Metrics
----------

              precision    recall  f1-score   support

      damage       0.93      0.98      0.96       154
        tape       1.00      0.00      0.00       105
     wrinkle       0.67      0.97      0.79       217

    accuracy                           0.76       476
   macro avg       0.87      0.65      0.58       476
weighted avg       0.83      0.76      0.67       476

Confusion Matrix
----------

[[151   0   3]
 [  4   0 101]
 [  7   0 210]]

Test Metrics
------------

Classification Metrics
----------

              precision    recall  f1-score   support

      damage       0.95      0.98      0.96       261
        tape       0.00      0.00      0.00        49
     wrinkle       0.79      0.97      0.87       186

    accuracy                           0.88       496
   macro avg       0.58      0.65      0.61       496
weighted avg       0.80      0.88      0.83       496

Confusion Matrix
----------

[[255   0   6]
 [  8   0  41]
 [  5   1 180]]
