Model Summary
----------

Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 256, 256, 64)      1664      
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 256, 256, 64)      102464    
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 128, 128, 64)      0         
_________________________________________________________________
batch_normalization (BatchNo (None, 128, 128, 64)      256       
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 128, 128, 128)     73856     
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 128, 128, 128)     147584    
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 64, 64, 128)       0         
_________________________________________________________________
batch_normalization_1 (Batch (None, 64, 64, 128)       512       
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 64, 64, 256)       295168    
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 64, 64, 256)       590080    
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 32, 32, 256)       0         
_________________________________________________________________
batch_normalization_2 (Batch (None, 32, 32, 256)       1024      
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 32, 32, 512)       1180160   
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 32, 32, 512)       2359808   
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 16, 16, 512)       0         
_________________________________________________________________
batch_normalization_3 (Batch (None, 16, 16, 512)       2048      
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 8, 8, 512)         0         
_________________________________________________________________
batch_normalization_4 (Batch (None, 8, 8, 512)         2048      
_________________________________________________________________
global_average_pooling2d (Gl (None, 512)               0         
_________________________________________________________________
dense (Dense)                (None, 2048)              1050624   
_________________________________________________________________
dropout (Dropout)            (None, 2048)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 1024)              2098176   
_________________________________________________________________
dropout_1 (Dropout)          (None, 1024)              0         
_________________________________________________________________
dense_2 (Dense)              (None, 3)                 3075      
=================================================================
Total params: 7,908,547
Trainable params: 7,905,603
Non-trainable params: 2,944
_________________________________________________________________

Train Metrics
------------

Classification Metrics
----------

              precision    recall  f1-score   support

      damage       0.99      0.94      0.96       154
        tape       1.00      0.01      0.02       105
     wrinkle       0.66      1.00      0.80       217

    accuracy                           0.76       476
   macro avg       0.88      0.65      0.59       476
weighted avg       0.84      0.76      0.68       476

Confusion Matrix
----------

[[145   0   9]
 [  2   1 102]
 [  0   0 217]]

Test Metrics
------------

Classification Metrics
----------

              precision    recall  f1-score   support

      damage       0.99      0.90      0.94       261
        tape       0.00      0.00      0.00        49
     wrinkle       0.73      0.99      0.84       186

    accuracy                           0.84       496
   macro avg       0.57      0.63      0.59       496
weighted avg       0.79      0.84      0.81       496

Confusion Matrix
----------

[[235   7  19]
 [  1   0  48]
 [  2   0 184]]
