
 *******Discriminator*******

Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 784)]             0         
_________________________________________________________________
dense_1 (Dense)              (None, 512)               401920    
_________________________________________________________________
dense_2 (Dense)              (None, 256)               131328    
_________________________________________________________________
dense_3 (Dense)              (None, 1)                 257       
=================================================================
Total params: 533,505
Trainable params: 0
Non-trainable params: 533,505
_________________________________________________________________
*******Generator*******

Model: "model_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_2 (InputLayer)         [(None, 200)]             0         
_________________________________________________________________
dense_4 (Dense)              (None, 256)               51456     
_________________________________________________________________
batch_normalization (BatchNo (None, 256)               1024      
_________________________________________________________________
dense_5 (Dense)              (None, 512)               131584    
_________________________________________________________________
batch_normalization_1 (Batch (None, 512)               2048      
_________________________________________________________________
dense_6 (Dense)              (None, 1024)              525312    
_________________________________________________________________
batch_normalization_2 (Batch (None, 1024)              4096      
_________________________________________________________________
dense_7 (Dense)              (None, 784)               803600    
=================================================================
Total params: 1,519,120
Trainable params: 1,515,536
Non-trainable params: 3,584
_________________________________________________________________
*******Combined GAN Model*******

Model: "model_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_3 (InputLayer)         [(None, 200)]             0         
_________________________________________________________________
model_1 (Model)              (None, 784)               1519120   
_________________________________________________________________
model (Model)                (None, 1)                 533505    
=================================================================
Total params: 2,052,625
Trainable params: 1,515,536
Non-trainable params: 537,089
_________________________________________________________________